README.tex
% Created 2016-05-17 Tue 17:42
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Jacob Sonnenberg}
\date{\today}
\title{Building a DSL for Music Composition}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 24.5.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

\section{Introduction}
\label{sec-1}
The purpose of this document is to outline what I learned in
creating a small domain specific language for music
composition. There are three main parts in this project: the engine
the DSL is built on, the raw string data that's parsed into music
data, and finally the macros which allow some convenience in working
in the DSL in Elixir.

The later two represent two approaches to building (or extending)
languages. Raw strings can be very expressive for many purposes when
parsed since there's no limit on how complexly language is
constructed, and provide only an unstructured way for extending a
language. On the other hand macros are a more structured form of
language extension and DSL construction.

The order topics are covered reflects the order I built them in. In
Lisp tradition I built it from the ground up, creating the basis for
the application and abstracting on top of that.
\section{The engine}
\label{sec-2}
Underlying the higher level constructs for constructing pieces of
music is the struct-based data representation. There are five
data-types:
\begin{enumerate}
\item Piece
\item Rest
\item Chord
\item Staff
\item Note
\end{enumerate}
The first three are simpler than the last two. \texttt{Piece}'s and
\texttt{Chord}'s are just structural indicators on \texttt{Staff}'s and \texttt{Note}'s
respectively. \texttt{Rest}'s are just placeholders for an empty location
in a staff where a note typically exists.

\subsection{Note Module}
\label{sec-2-1}
This module defines a note struct and methods to generate sound
data based off of the fields of \texttt{Note} structs. As it stands it
relies on the external program \emph{SoX} to generate the note
sounds. This back-end for generating the sounds can be changed with
a small amount of effort because, fortunately, the procedures for
performing that sound generation is relegated to only a couple
modules.

The two most important functions in \href{lib/harpsi.ex}{Note} are \texttt{play} and
\texttt{note\_args}. \texttt{play} invokes the system call and \texttt{note\_args}
constructs the arguments that will be passed to the "play" program
provided by SoX.
\begin{verbatim}
def play(note, opts \\ %{}) do
  System.cmd("play", note_args(note, opts))
end

defp note_args(note, opts) do
  ["-qn", "synth",
   to_string(4 / note.type),
   Map.get(opts, :type, "pluck"),
   process_note(note),
   "vol", Map.get(opts, :vol, "1")
  ]
end
\end{verbatim}

\subsection{Staff Module}
\label{sec-2-2}
The \texttt{Staff} module defines the majority of the behavior for groups
of notes. The main function of this is to handle beats-per-minute
associated with a collection of measures, or notes.

\texttt{Staff} is the main mover in the underlying engine as it groks most
of the various data-types and understands what to do with
them. The of structure of \texttt{Staff}'s are transformed to
a list of time-annotated notes, the associated time data specifies
how many milliseconds into execution the note is played.

The backbone of \texttt{Staff}, \texttt{tag\_note\_delays} was put together before
I had a more complete understanding of what I was doing but
nevertheless serves its function well enough. It serves to flatten
the structure of the piece, everything under staff level becomes a
2-tuple with the first place denoting the time at which the note is
played, and the second is the actual note itself.

\subsection{Piece, Rest, and Chord Modules}
\label{sec-2-3}
These modules are very limited in scope and have a lot of room for
improvement in the future. \texttt{Rest}'s and \texttt{Chord}'s are elements of
\texttt{Staff}'s, and \texttt{Staff}'s are elements in \texttt{Piece}'s. They serve
mostly to implement structural alterations to music pieces and are
parsed out of existence early on.

\section{The language}
\label{sec-3}
The language is made up of two major parts, macros and
note-strings. Macros provide some convenience facility for writing
in Elixir while the note-strings are bit-strings which are parsed to
generate the data.

\subsection{Note-Strings in the language}
\label{sec-3-1}
In Harpsi the actual playable data is decided primarily by
note-strings. The note-strings are parsed into chords and notes and
act as below staff level. Transformation from raw string to
playable data structure is performed by the \href{lib/parser.ex}{Parser}. The
backbone of the \texttt{Parser} is \texttt{process\_word} which serves as a
dispatch to the various rules defining how the notes are
constructed, each case of the cond serve as the individual rules
for note construction. The rules of course can be any elixir
expression. Regular expressions serve as the rules for how notes
are constructed.

The `bottom' of the language is \texttt{process\_note}, every word must
decompose into single letters naming the notes A through G, or a
rest. The language for note-strings is essentially a series of
manipulations on \texttt{Note}, \texttt{Chord}, and \texttt{Rest} structs, and so exists in the
small domain that currently allows. In the future this domain could
be expanded by changing a finite number of (albeit yet
undocumented) functions, and adding more fields to the two structs,
and enhancing the engine. But it serves as a simple basis for my
purposes that permits some limited amount of expression.

As for rules, a good example is \texttt{process\_doctave}:
\begin{verbatim}
def process_doctave(word, opts) do
  cap = Regex.named_captures(~r/^(?<up_or_down>[<>])(?<word>.*)/, word)
  process_word(cap["word"], Map.put(opts, :octave,
	opts.octave + (case cap["up_or_down"] do
			 "<" -> -1
			 ">" -> 1
		       end)))
end
\end{verbatim}
This one is changes the the octave by a shift of

Each rule should work on a certain foundation that could
potentially be better enforced as macro. Implementing it is an
exercise for the reader, but I'll note patterns that exist. The
\texttt{word} arg is the individual note-string note in a staff. This is
dissected by the rules via regex into the three basic structs,
\texttt{Note} and \texttt{Chord}, and \texttt{Rest}. On the other hand \texttt{opts} is
concerned with the rest of the data associated with the notes.

Most rules are built like
\begin{verbatim}
def process_<case>(word, opts) do
  cap = Regex.named_captures(<regex recognizing case>, word)
  process_word(<transformation on cap["word"]>,
    <transformations of the structs>)
end
\end{verbatim}
with a little imagination, one could construct a macro for defining
these rules in a structured way by templating the above snippet and
adding an entry to a list of callback functions invoked by
\texttt{process\_word}. More generally, the rules should have one of three
things in the tail place of the function. That is,
\begin{enumerate}
\item A recursive call back to \texttt{process\_word} with modified parameters
\item A \texttt{Note} struct
\item A \texttt{Rest} struct
\end{enumerate}
Chord not included in the list because they're only a structure
requiring constituent notes, of course.

\subsection{Macros in the language}
\label{sec-3-2}
All the macros exist in in \href{lib/lang.ex}{Lang}. The foremost actor is
the \texttt{piece} macro which reflects the \texttt{Piece} struct. When writing
in Harpsi the \texttt{piece} macro provides a manipulable environment for
writing \texttt{Staff}'s of music and building the whole structure of the
playable \texttt{Piece}.

As stated there are two variable dimensions, the `buffer' of music
and the `environment' the notes are created in. In \texttt{Lang} you'll
find I use two agents to model this behavior in a unhygienic way,
requiring a set of functions to handle an ad-hoc, unspecified
behaviors for constructing the buffer and maintaining the
environment. Agents are "simple abstractions around state", some
shared state is kept in it so the state is accessible at different
points in macro expansion

The buffer agent simply accumulates the musical structure and
returns a list of \texttt{Staff}'s, and the environment agent tracks the
state of the environment as a stack. Management of the environment
is especially straight forward. The environment is initialized with
the \texttt{start\_env} function.

\begin{verbatim}
def start_env(), do: Agent.start_link(fn ->
  [%{bpm: 120, octave: 4, type: 4}] end)
\end{verbatim}

This starts an agent with an initial element in the stack which
serves as the `default' environment. The environment is maintained
with a set of three functions:

\begin{verbatim}
def push_env(env, attr_map) do
  new = Map.merge(get_env(env), attr_map)
  Agent.update(env, &[new | &1])
end

def get_env(env), do: Agent.get(env, &(&1)) |> hd

def pop_env(env), do: Agent.update(env, &tl/1)
\end{verbatim}

The functional requirements are minimal and the behavior
is pretty intuitive. It's a simple stack that implements push, pop,
and peek. The \texttt{Agent} must be cleaned up after use.

\begin{verbatim}
def stop_env(env), do: Agent.stop(env)
\end{verbatim}

If built with the proper initialization and cleanup of the
environment and changes to it, macros built with these two simple
tools allow for some flexibility in potential language
constructs. A obvious pattern is the closure, a language construct
that clearly marks the beginning and end of some modification to
the environment. In the language of Harpsi this is of course is a
vocabulary limited by the underlying data-structures and what can
be done with them.

The macro \texttt{bpm} in \href{lib/lang.ex}{Lang} is a closure with a predefined item in the
environment the construct will manipulate.

\begin{verbatim}
defmacro bpm(n, do: inner) do
  quote do
    push_env var!(env, Lang),
      %{bpm: unquote(n)}
    unquote(inner)
    pop_env var!(env, Lang)
  end
end
\end{verbatim}

Of course, \texttt{bpm} manipulates the beats per minute of a
\texttt{Staff}. Such specific operations should generally be avoided
because maintaining a language can become cumbersome if the domain
grows too large. Instead favor generic interfaces to achieve the
effect of a battalion of special cases.

\begin{verbatim}
defmacro w_opt(kwl, do: inner) do
  quote do
    push_env var!(env, Lang),
      Enum.into(unquote(kwl), %{})
    unquote(inner)
    pop_env var!(env, Lang)
  end
end
\end{verbatim}

The structure of the piece of music is encoded into macros as
well. Witht the \texttt{piece} macro and \texttt{staff} macro for composing
staffs and notes respectively. \texttt{piece} only initializes the two
helper agents and puts the result of processing the macro's body
into a \texttt{Piece} struct. \texttt{staff} similarly reflects the underlying
\texttt{Staff} structs, generating a struct based on the environment it's
constructed in, and the string passed to the macro.

\begin{verbatim}
defmacro staff(inner) do
  quote do
    put_buffer var!(buffer, Lang),
      %Staff{bpm: get_env(var!(env, Lang))[:bpm],
	     octave: get_env(var!(env, Lang))[:octave],
	     measures: process_notestring(unquote(inner), get_env(var!(env, Lang)))}
  end
end
\end{verbatim}

\texttt{Staff}'s are collected into the shared \texttt{buffer} variable, and
placed in a \texttt{Piece}.

\section{Conclusion}
\label{sec-4}
If I were to do it over again I'd scrap the string processing
portion of it, A set of functions or macros with equivalent
functionality I expect would be comparably as simple to create while
allowing for easier composability conferred by using the mother
language's extension facilities (i.e. macros and functions).

\href{lib/sheet.ex}{Sheets} is a list of pieces of executable music I created while
developing Harpsi, ordered (more or less) from the oldest piece at
the top to the latest at the bottom. As is easily observable the
language used to write the pieces becomes more expressive. I left in
the functions that served as an ad-hoc sketch of later iterations of
the language (\texttt{times}, \texttt{ctc}, \texttt{ntc}, and \texttt{ntb}). These functions
reflect the what was implemented through parsing and macros.

  The last two functions in \texttt{Sheets} are pieces in the final
  language. They're my rather poor renditions of Ring Around the Rosie
  and London Bridge.
g
% Emacs 24.5.1 (Org mode 8.2.10)
\end{document}
